trade_exp/src/Catalogs/КритерииДляТиповТС/КритерииДляТиповТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="88803074-3813-457c-a69a-364180c0a167">
  <name>КритерииДляТиповТС</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="e9df5f97-a54b-4c82-bf6a-0394e25fd5eb">
    <name>СегментНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0e3e477e-e0d6-419f-9a1c-b0e89da0cb95">
    <name>ВидНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e5caf3a8-947d-4f18-b913-524314ead160">
    <name>ТипИзмеряемойВеличины</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5171cfac-5edb-4092-a129-64a89c3407be">
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="723f0d5e-922d-4338-87ef-2370dbc3c062">
    <name>МинимальноеЗначение</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>7</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f3498a7a-8f80-47a2-afb6-d38bb7acd0a1">
    <name>МаксимальноеЗначение</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>7</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="afb00216-0d29-4094-9a31-0f99a015aa99">
    <name>ОграничениеПоКоличеству</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="df9b8e55-84be-4756-934c-527de6a90cd1">
    <name>Обозначение</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9ea14f2c-01c4-4367-a6cf-ab2b8b493d90">
    <name>Поддон</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d51447d2-7496-4320-b27d-028d126650e1">
    <name>СборнаяОРК</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

trade_exp/src/Enums/ТипыИзмеряемыхВеличин/ТипыИзмеряемыхВеличин.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыИзмеряемыхВеличин</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="39bca12a-73d8-4f63-b175-8d09e27f1889">
    <name>Энергия</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="9fe5bd6a-0dc3-492a-8124-5d8374b7dc0f">
    <name>Вес</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="166d8d12-5edc-4ab3-859d-fbfc26f1f783">
    <name>КоличествоШтук</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="03b65f12-3868-4b16-a177-ed2ec292ca2c">
    <name>Площадь</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="ae31522b-14d7-4a69-9cc9-ccad6a27391d">
    <name>Объем</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="654bd14d-c881-4925-beea-5643856794e3">
    <name>Длина</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="63b8d3ae-e98a-46bc-9820-21ca637b2ea5">
    <name>ЭлектрическийЗаряд</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="755c3036-63aa-4cd7-bb48-ea6719b0f5f1">
    <name>Мощность</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="99ce385b-b097-477a-9cb5-30caba0dd9e5">
    <name>Время</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/КритерииДляТиповТС/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	Если ЗначениеЗаполнено(ЕдиницаИзмерения) И ЕдиницаИзмерения.ТипИзмеряемойВеличины = Перечисления.ТипыИзмеряемыхВеличин.Упаковка Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Неверно указана единица измерения! 'Тип измеряемой величины' элемента не должен быть = 'Упаковка'!");  
	КонецЕсли;
	
	Если Не Отказ Тогда
		Если ЗначениеЗаполнено(МинимальноеЗначение) И ЗначениеЗаполнено(МаксимальноеЗначение) И МинимальноеЗначение > МаксимальноеЗначение Тогда 
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("Минимальное значение должно быть меньше, чем Максимальное!");
		ИначеЕсли Не ЗначениеЗаполнено(МинимальноеЗначение) И Не ЗначениеЗаполнено(МаксимальноеЗначение) Тогда
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("Необходимо заполнить Минимальное либо Максимальное значение!");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецЕсли
